# discover Missing Value

In [2]:
import numpy as np 
import pandas as pd 
from pandas import Series, DataFrame

In [11]:
missing = np.nan
series_obj= Series(['1','2', '3', '4', '5', missing, '6'])
series_obj

0      1
1      2
2      3
3      4
4      5
5    NaN
6      6
dtype: object

In [12]:
series_obj.isnull()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

# filling missing value

In [13]:
np.random.seed(25)

In [16]:
df_obj=DataFrame(np.random.rand(36).reshape(6,6))
df_obj

          0         1         2         3         4         5
0  0.590885  0.163652  0.836928  0.775203  0.169041  0.766994
1  0.335366  0.472398  0.215064  0.912094  0.759208  0.676561
2  0.021376  0.660874  0.094440  0.831163  0.112749  0.566830
3  0.174626  0.790607  0.033683  0.795971  0.689437  0.491846
4  0.088554  0.937550  0.084362  0.469394  0.805613  0.085646
5  0.244380  0.892806  0.478611  0.190401  0.253044  0.762339

In [24]:
df_obj.loc[3:5, 0] = missing 
df_obj.loc[0:2, 5] = missing

In [25]:
df_obj

          0         1         2         3         4         5
0  0.590885  0.163652  0.836928  0.775203  0.169041       NaN
1  0.335366  0.472398  0.215064  0.912094  0.759208       NaN
2  0.021376  0.660874  0.094440  0.831163  0.112749       NaN
3       NaN  0.790607  0.033683  0.795971  0.689437  0.491846
4       NaN  0.937550  0.084362  0.469394  0.805613  0.085646
5       NaN  0.892806  0.478611  0.190401  0.253044  0.762339

In [28]:
df_obj_fill=df_obj.fillna(8) #fillna is a function to fill the missing value

In [29]:
df_obj_fill

          0         1         2         3         4         5
0  0.590885  0.163652  0.836928  0.775203  0.169041  8.000000
1  0.335366  0.472398  0.215064  0.912094  0.759208  8.000000
2  0.021376  0.660874  0.094440  0.831163  0.112749  8.000000
3  8.000000  0.790607  0.033683  0.795971  0.689437  0.491846
4  8.000000  0.937550  0.084362  0.469394  0.805613  0.085646
5  8.000000  0.892806  0.478611  0.190401  0.253044  0.762339

In [32]:
df_obj_fill=df_obj.fillna(method='ffill')

In [33]:
df_obj_fill

          0         1         2         3         4         5
0  0.590885  0.163652  0.836928  0.775203  0.169041       NaN
1  0.335366  0.472398  0.215064  0.912094  0.759208       NaN
2  0.021376  0.660874  0.094440  0.831163  0.112749       NaN
3  0.021376  0.790607  0.033683  0.795971  0.689437  0.491846
4  0.021376  0.937550  0.084362  0.469394  0.805613  0.085646
5  0.021376  0.892806  0.478611  0.190401  0.253044  0.762339